Commit: find and delete duplicate data

### find and delete duplicate data

Duplicate data can cause issues in data analysis and machine learning models. Here are the steps to find, handle, and remove duplicate data:

1. **Find Duplicate Data**:
    - Use the `duplicated()` method to identify duplicate rows.
    - Example: `df.duplicated()`

2. **Handle Duplicate Data**:
    - You can choose to keep the first occurrence and mark the rest as duplicates.
    - Example: `df.duplicated(keep='first')`

3. **Remove Duplicate Data**:
    - Use the `drop_duplicates()` method to remove duplicate rows.
    - Example: `df.drop_duplicates(inplace=True)`

By following these steps, you can ensure that your dataset is free from duplicate entries, leading to more accurate analysis and modeling.

#### Find Duplicate Data

In [46]:
import pandas as pd


data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Alice","Charlie"],
    "eng": [85, 90, 78, 85, 85,78],
    "bangla": [80, 85, 75, 90, 80,99]
}

In [47]:
df = pd.DataFrame(data)
df
# Charlie not duplicate because bangla mark not same

      name  eng  bangla
0    Alice   85      80
1      Bob   90      85
2  Charlie   78      75
3    David   85      90
4    Alice   85      80
5  Charlie   78      99

In [48]:
#df["duplicate"] = df.duplicated()
df

      name  eng  bangla
0    Alice   85      80
1      Bob   90      85
2  Charlie   78      75
3    David   85      90
4    Alice   85      80
5  Charlie   78      99

In [49]:
df.drop_duplicates(inplace=True)
df

      name  eng  bangla
0    Alice   85      80
1      Bob   90      85
2  Charlie   78      75
3    David   85      90
5  Charlie   78      99